DistributedDataParallel(
  (module): DrugBAN(
    (drug_extractor): MolecularGCN(
      (init_transform): Linear(in_features=75, out_features=128, bias=False)
      (gnn): GCN(
        (gnn_layers): ModuleList(
          (0-2): 3 x GCNLayer(
            (graph_conv): GraphConv(in=128, out=128, normalization=none, activation=<function relu at 0x7fa61803f550>)
            (dropout): Dropout(p=0.0, inplace=False)
            (res_connection): Linear(in_features=128, out_features=128, bias=True)
            (bn_layer): SyncBatchNorm(128, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
          )
        )
      )
    )
    (protein_extractor): ProteinCNN(
      (embedding): Embedding(26, 128, padding_idx=0)
      (cnnLayers): ModuleList(
        (0): Sequential(
          (0): ZeroPad2d((1, 1, 0, 0))
          (1): Conv1d(128, 128, kernel_size=(3,), stride=(1,))
          (2): ReLU()
          (3): SyncBatchNorm(128, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
        )
        (1): Sequential(
          (0): ZeroPad2d((3, 2, 0, 0))
          (1): Conv1d(128, 128, kernel_size=(6,), stride=(1,))
          (2): ReLU()
          (3): SyncBatchNorm(128, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
        )
        (2): Sequential(
          (0): ZeroPad2d((4, 4, 0, 0))
          (1): Conv1d(128, 128, kernel_size=(9,), stride=(1,))
          (2): ReLU()
          (3): SyncBatchNorm(128, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
        )
      )
    )
    (FocalAtt): FocalAtt(
      (CA): SorCA(
        (mhatt): MHAtt(
          (linear_v): Linear(in_features=128, out_features=256, bias=True)
          (linear_v0): Linear(in_features=128, out_features=256, bias=True)
          (linear_q0): Linear(in_features=128, out_features=256, bias=True)
          (Att_Map): AttM(
            (linear_q): Linear(in_features=128, out_features=256, bias=True)
            (linear_k): Linear(in_features=128, out_features=256, bias=True)
            (dropout): Dropout(p=0.2, inplace=False)
          )
          (norm_q): LayerNorm()
          (linear_merge): Linear(in_features=256, out_features=256, bias=True)
          (dropout): Dropout(p=0.2, inplace=False)
          (norm): LayerNorm()
        )
        (ffn): FFN(
          (linear1): Linear(in_features=256, out_features=512, bias=True)
          (linear2): Linear(in_features=512, out_features=256, bias=True)
          (relu): ReLU(inplace=True)
          (dropout): Dropout(p=0.2, inplace=False)
        )
        (dropout): Dropout(p=0.2, inplace=False)
        (norm): LayerNorm()
        (PosEnc_q): PositionalEncoding(
          (dropout): Dropout(p=0.2, inplace=False)
        )
        (PosEnc_k): PositionalEncoding(
          (dropout): Dropout(p=0.2, inplace=False)
        )
      )
    )
    (CAtt_pro1): SorCAtt(
      (dec_list): ModuleList()
      (dec_end): SorCA(
        (mhatt): MHAtt(
          (linear_v): Linear(in_features=128, out_features=256, bias=True)
          (linear_v0): Linear(in_features=128, out_features=256, bias=True)
          (linear_q0): Linear(in_features=128, out_features=256, bias=True)
          (Att_Map): AttM(
            (linear_q): Linear(in_features=128, out_features=256, bias=True)
            (linear_k): Linear(in_features=128, out_features=256, bias=True)
            (dropout): Dropout(p=0.2, inplace=False)
          )
          (norm_q): LayerNorm()
          (linear_merge): Linear(in_features=256, out_features=256, bias=True)
          (dropout): Dropout(p=0.2, inplace=False)
          (norm): LayerNorm()
        )
        (ffn): FFN(
          (linear1): Linear(in_features=256, out_features=512, bias=True)
          (linear2): Linear(in_features=512, out_features=256, bias=True)
          (relu): ReLU(inplace=True)
          (dropout): Dropout(p=0.2, inplace=False)
        )
        (dropout): Dropout(p=0.2, inplace=False)
        (norm): LayerNorm()
        (PosEnc_q): PositionalEncoding(
          (dropout): Dropout(p=0.2, inplace=False)
        )
        (PosEnc_k): PositionalEncoding(
          (dropout): Dropout(p=0.2, inplace=False)
        )
      )
    )
    (CAtt_pro2): SorCAtt(
      (dec_list): ModuleList()
      (dec_end): SorCA(
        (mhatt): MHAtt(
          (linear_v): Linear(in_features=256, out_features=256, bias=True)
          (linear_v0): Linear(in_features=256, out_features=256, bias=True)
          (linear_q0): Linear(in_features=128, out_features=256, bias=True)
          (Att_Map): AttM(
            (linear_q): Linear(in_features=128, out_features=256, bias=True)
            (linear_k): Linear(in_features=256, out_features=256, bias=True)
            (dropout): Dropout(p=0.2, inplace=False)
          )
          (norm_q): LayerNorm()
          (linear_merge): Linear(in_features=256, out_features=256, bias=True)
          (dropout): Dropout(p=0.2, inplace=False)
          (norm): LayerNorm()
        )
        (ffn): FFN(
          (linear1): Linear(in_features=256, out_features=512, bias=True)
          (linear2): Linear(in_features=512, out_features=256, bias=True)
          (relu): ReLU(inplace=True)
          (dropout): Dropout(p=0.2, inplace=False)
        )
        (dropout): Dropout(p=0.2, inplace=False)
        (norm): LayerNorm()
        (PosEnc_q): PositionalEncoding(
          (dropout): Dropout(p=0.2, inplace=False)
        )
        (PosEnc_k): PositionalEncoding(
          (dropout): Dropout(p=0.2, inplace=False)
        )
      )
    )
    (mlp_classifier): MLPDecoder(
      (fc1): Linear(in_features=256, out_features=512, bias=True)
      (bn1): SyncBatchNorm(512, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (fc2): Linear(in_features=512, out_features=128, bias=True)
      (bn2): SyncBatchNorm(128, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
      (fc3): Linear(in_features=128, out_features=1, bias=True)
    )
  )
)